# Importing CSV files

In [1]:
import csv
import pandas as pd
import os

school_data_to_load = os.path.join("Resources", "schools_complete.csv")
student_data_to_load = os.path.join("Resources", "students_complete.csv")

school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

# Inspecting the DataFrames

In [2]:
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [3]:
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

# Cleaning the DataFrames

In [4]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [5]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [6]:
school_data_df.isnull().sum()   # the sum() method will sum up all the values in the column that are "True"

School ID      0
school_name    0
type           0
size           0
budget         0
dtype: int64

In [7]:
student_data_df.notnull().sum()  # all of the values in the DataFrame are not null

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [8]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [9]:
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [10]:
# Extracting the Prefixes and Suffixes and cleaning 

student_name_list = student_data_df["student_name"].tolist()

prefixes = []
suffixes = []

for name in student_name_list:
    if len(name.split()[0]) <= 4:
        prefixes.append(name.split()[0])
    if len(name.split()[-1]) <= 3:
        suffixes.append(name.split()[-1])
        
print(set(prefixes), set(suffixes))

prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].replace(word,"")

{'Alex', 'Ian', 'Sara', 'Rose', 'Mike', 'Bill', 'Cody', 'Gary', 'Dan', 'Lisa', 'Joe', 'Jo', 'Ann', 'John', 'Joel', 'Tim', 'Leah', 'Mary', 'Luke', 'Dean', 'Beth', 'Jody', 'Jack', 'Karl', 'Ross', 'Leon', 'Amy', 'Joan', 'Kent', 'Tom', 'Cory', 'Luis', 'Dr.', 'Jean', 'Dale', 'Rick', 'Jose', 'Jon', 'Bob', 'Jeff', 'Ruth', 'Cole', 'Alec', 'Dawn', 'Tara', 'Toni', 'Glen', 'Greg', 'Drew', 'Emma', 'Carl', 'Eric', 'Jodi', 'Max', 'Joy', 'Kara', 'Jane', 'Jake', 'Don', 'Miss', 'Jay', 'Troy', 'Kyle', 'Zoe', 'Lynn', 'Roy', 'Lee', 'Mark', 'Kurt', 'Dave', 'Evan', 'Lori', 'Mrs.', 'Nina', 'Erin', 'Earl', 'Guy', 'Anne', 'Neil', 'Seth', 'Judy', 'Kirk', 'Fred', 'Sean', 'Ryan', 'Anna', 'Ms.', 'Marc', 'Omar', 'Mr.', 'Tony', 'Gene', 'Brad', 'Juan', 'Adam', 'Jade', 'Tami', 'Ana', 'Noah', 'Jim', 'Pam', 'Jill', 'Kari', 'Gail', 'Kim', 'Paul', 'Todd', 'Rita', 'Dana', 'Sue', 'Ivan', 'Ray', 'Mia', 'Chad', 'Erik', 'Levi', 'Alan', 'Tina', 'Gina'} {'Li', 'DDS', 'Key', 'MD', 'Yu', 'IV', 'Ali', 'Orr', 'II', 'Roy', 'Cox', 'Lee', 'V', 'III', 'Lin', 'Ho', 'DVM', 'Kim', 'PhD', 'Wu', 'Fox', 'Ray', 'Jr.', 'Liu', 'Fry', 'Lam', 'Le', 'Day', 'Gay', 'May'}

# District Key Metrics

In [13]:
# Merging the DataFrames

school_data_complete_df = pd.merge(student_data_df, school_data_df, on = "school_name")
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [15]:
school_data_complete_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [18]:
# Student count

student_count = school_data_complete_df["Student ID"].count()
statment = (
            f"In total we have {student_count:,} students.")
print(statment)

In total we have 39,170 students.

In [32]:
# School count

school_count = len(school_data_complete_df["school_name"].unique())
# we can also use:
# school_count = len(set(school_data_complete_df["school_name"]))
statment = (
            f"In total we have {school_count:,} schools.")
print(statment)

In total we have 15 schools.

In [34]:
# Total Budget

total_budget = school_data_df["budget"].sum()
statment = (
            f"The total budget of all the schools is ${total_budget:,}")
print(statment)

The total budget of all the schools is $24,649,428

In [36]:
# Average reading score and math score

average_reading_score = school_data_complete_df["reading_score"].mean()
average_math_score = school_data_complete_df["math_score"].mean()
statment = (
            f"the average reading score is: {average_reading_score:.2f}\nthe average math score is: {average_math_score:.2f}")
print(statment)

the average reading score is: 81.88
the average math score is: 78.99

In [55]:
# determining the % of students that passed reading and the % that passed math

passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]

# we can use the following also:
# passing_math = school_data_complete_df.loc[school_data_complete_df["math_score"] >= 70,:]
# passing_reading = school_data_complete_df.loc[school_data_complete_df["reading_score"] >= 70,:]

passing_reading_count = passing_reading["student_name"].count()
passing_math_count = passing_math["student_name"].count()

passing_math_percentage = passing_math_count/float(student_count) * 100
passing_reading_percentage = passing_reading_count/float(student_count) * 100

statment= (
            f"Number of students passing math: {passing_math_count:,} ({passing_math_percentage:.2f}%)\n"
            f"Number of students passing reading: {passing_reading_count:,} ({passing_reading_percentage:.2f}%)")
print(statment)

Number of students passing math: 29,370 (74.98%)
Number of students passing reading: 33,610 (85.81%)

In [61]:
# The overall passing percentage

passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) 
                                               & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading_count = passing_math_reading["student_name"].count()

passing_math_reading_percentage = passing_math_reading_count/float(student_count) * 100

statment = (
            f"Number of students passing both math and reading: {passing_math_reading_count:,} ({passing_math_reading_percentage:.2f}%)")
print(statment)

Number of students passing both math and reading: 25,528 (65.17%)

In [64]:
# School District Summary

district_summary_df = pd.DataFrame(
                                    [{"Total Schools":school_count,
                                    "Total Students":student_count,
                                    "Total Budget":total_budget,
                                    "Average Math Score":average_math_score,
                                    "Average Reading Score":average_reading_score,
                                    "% Passing Math":passing_math_percentage,
                                    "% Passing Reading":passing_reading_percentage,
                                    "% Overall Passing":passing_math_reading_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326